oe-rv2309/mugen-x86_rc3/logs/fio/oe_test_fio_002/2023-09-11-21_24_48.log
+ source ./common/disk_lib.sh
++ source /root/mugen/libs/locallibs/common_lib.sh
+++ python3 --version
+++ '[' 0 -eq 0 ']'
+++ source /root/mugen/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment!'
+ message='Start to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment!'
Mon Sep 11 21:24:51 2023 - INFO  - Start to prepare the test environment!
+ check_free_disk
++ TEST_DISK
++ id=1
++ python3 /root/mugen/libs/locallibs/get_test_device.py --device disk --node 1
+ disks=vdb
+ disk_list=($disks)
+ local_disk=vdb
+ local_disk1=
+ local_disk2=
+ local_disk3=
+ DNF_INSTALL fio
+ pkgs=fio
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/mugen/libs/locallibs/rpm_manage.py install --pkgs fio --node 1 --tempfile ''
Mon Sep 11 21:25:08 2023 - INFO  - pkgs:(fio) is already installed
+ tmpfile2=
+ '[' -z '' ']'
+ tmpfile=
+ test -f test.txt
+ touch test.txt
+ LOG_INFO 'End to prepare the test environment!'
+ message='End to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to prepare the test environment!'
Mon Sep 11 21:25:08 2023 - INFO  - End to prepare the test environment!
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start executing testcase!'
+ message='Start executing testcase!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start executing testcase!'
Mon Sep 11 21:25:09 2023 - INFO  - Start executing testcase!
+ fio-dedupe -o 1 /dev/vdb
+ grep 'items processed'
Threads(4): 128000 items processed
+ CHECK_RESULT 0 0 0 'fio-dedupe -o option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -o option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ grep 'items processed'
+ fio-dedupe -c 1 /dev/
+ CHECK_RESULT 1 0 0 'fio-dedupe -c option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -c option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -c option failed'
+ LOG_ERROR 'fio-dedupe -c option failed'
+ message='fio-dedupe -c option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -c option failed'
Mon Sep 11 21:25:10 2023 - ERROR - fio-dedupe -c option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 33'
+ message='oe_test_fio_002.sh line 33'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 33'
Mon Sep 11 21:25:11 2023 - ERROR - oe_test_fio_002.sh line 33
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -B 1 /dev/
+ CHECK_RESULT 1 0 0 'fio-dedupe -B option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -B option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -B option failed'
+ LOG_ERROR 'fio-dedupe -B option failed'
+ message='fio-dedupe -B option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -B option failed'
Mon Sep 11 21:25:11 2023 - ERROR - fio-dedupe -B option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 35'
+ message='oe_test_fio_002.sh line 35'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 35'
Mon Sep 11 21:25:12 2023 - ERROR - oe_test_fio_002.sh line 35
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -p 1 /dev/
+ CHECK_RESULT 1 0 0 'fio-dedupe -p option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -p option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -p option failed'
+ LOG_ERROR 'fio-dedupe -p option failed'
+ message='fio-dedupe -p option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -p option failed'
Mon Sep 11 21:25:12 2023 - ERROR - fio-dedupe -p option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 37'
+ message='oe_test_fio_002.sh line 37'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 37'
Mon Sep 11 21:25:13 2023 - ERROR - oe_test_fio_002.sh line 37
+ '[' 0 -eq 1 ']'
+ return 0
+ fio --filename=test_file --direct=1 --rw=randwrite --numjobs=1 --iodepth=16 --ioengine=libaio --bs=4k --group_reporting --name=zhangyi --log_avg_msec=500 --write_bw_log=test-fio --size=1G
zhangyi: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.34
Starting 1 process
zhangyi: Laying out IO file (1 file / 1024MiB)

zhangyi: (groupid=0, jobs=1): err= 0: pid=1743: Mon Sep 11 21:26:52 2023
  write: IOPS=2668, BW=10.4MiB/s (10.9MB/s)(1024MiB/98243msec); 0 zone resets
    slat (usec): min=123, max=27887, avg=249.87, stdev=165.49
    clat (usec): min=17, max=128775, avg=5726.24, stdev=3497.88
     lat (usec): min=511, max=136980, avg=5976.11, stdev=3526.19
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    6], 40.00th=[    6], 50.00th=[    6], 60.00th=[    6],
     | 70.00th=[    6], 80.00th=[    7], 90.00th=[    7], 95.00th=[    8],
     | 99.00th=[   10], 99.50th=[   11], 99.90th=[   77], 99.95th=[  108],
     | 99.99th=[  120]
   bw (  KiB/s): min= 7141, max=12777, per=100.00%, avg=10682.53, stdev=1138.97, samples=195
   iops        : min= 1785, max= 3194, avg=2670.33, stdev=284.66, samples=195
  lat (usec)   : 20=0.01%, 50=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.32%, 10=99.13%, 20=0.31%, 50=0.10%
  lat (msec)   : 100=0.05%, 250=0.06%
  cpu          : usr=8.81%, sys=62.28%, ctx=16494, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=10.4MiB/s (10.9MB/s), 10.4MiB/s-10.4MiB/s (10.9MB/s-10.9MB/s), io=1024MiB (1074MB), run=98243-98243msec

Disk stats (read/write):
  vda: ios=1/262158, merge=0/10317, ticks=3/107420, in_queue=109595, util=99.93%
+ CHECK_RESULT 0 0 0 'fio --filename=test_file option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio --filename=test_file option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=959693/0, merge=0/0, ticks=141491/0, in_queue=141491, util=99.79%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=write -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=1034/958093, merge=0/248, ticks=153/269019, in_queue=269173, util=99.07%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randread -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
mytest: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.34
Starting 30 threads

mytest: (groupid=0, jobs=30): err= 0: pid=1828: Mon Sep 11 21:29:16 2023
  read: IOPS=19.9k, BW=311MiB/s (326MB/s)(14.6GiB/48203msec)
    clat (usec): min=101, max=255736, avg=1454.25, stdev=1244.24
     lat (usec): min=102, max=256128, avg=1456.21, stdev=1244.94
    clat percentiles (usec):
     |  1.00th=[  253],  5.00th=[  502], 10.00th=[  660], 20.00th=[  865],
     | 30.00th=[ 1029], 40.00th=[ 1188], 50.00th=[ 1336], 60.00th=[ 1483],
     | 70.00th=[ 1647], 80.00th=[ 1860], 90.00th=[ 2245], 95.00th=[ 2671],
     | 99.00th=[ 4113], 99.50th=[ 5604], 99.90th=[13566], 99.95th=[20317],
     | 99.99th=[39584]
   bw (  KiB/s): min=180327, max=685533, per=100.00%, avg=323276.52, stdev=2724.23, samples=2790
   iops        : min=11252, max=42833, avg=20190.90, stdev=170.27, samples=2790
  lat (usec)   : 250=0.96%, 500=4.01%, 750=8.94%, 1000=14.03%
  lat (msec)   : 2=56.81%, 4=14.17%, 10=0.91%, 20=0.12%, 50=0.05%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=1.42%, sys=7.94%, ctx=948822, majf=0, minf=120
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=960000,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=311MiB/s (326MB/s), 311MiB/s-311MiB/s (326MB/s-326MB/s), io=14.6GiB (15.7GB), run=48203-48203msec

Disk stats (read/write):
  vdb: ios=959945/0, merge=0/0, ticks=251666/0, in_queue=251666, util=95.49%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randwrite -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=922/959346, merge=0/10, ticks=190/249031, in_queue=249222, util=99.07%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest --output test.txt
+ test -f test.txt
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -d /dev/vdb,/dev/,/dev/ -a -b 4k,128k,1m -r 100 -a -x dellr720-day2/
Generating dellr720-day2/openeuler-riscv64-4k,128k,1m-all-write,randwrite,read,randread-vdb,dev,dev.fio
Estimated Time = 4800 seconds : 1 hour 20 minutes
+ test -d dellr720-day2
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -h
+ grep -i usage
usage of genfio:
+ CHECK_RESULT 0 0 0 'genfio -h option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='genfio -h option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ LOG_INFO 'End of testcase execution!'
+ message='End of testcase execution!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End of testcase execution!'
Mon Sep 11 21:31:13 2023 - INFO  - End of testcase execution!
+ CASE_RESULT 0
+ case_re=0
+ test -z 3
+ test 3 -gt 0
+ LOG_ERROR 'failed to execute the case.'
+ message='failed to execute the case.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'failed to execute the case.'
Mon Sep 11 21:31:13 2023 - ERROR - failed to execute the case.
+ exit 3
+ post_test
+ LOG_INFO 'Start environment cleanup.'
+ message='Start environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start environment cleanup.'
Mon Sep 11 21:31:14 2023 - INFO  - Start environment cleanup.
+ rm -rf test-fio_bw.1.log test.txt test_file dellr720-day2
+ DNF_REMOVE
+ node=1
+ pkg_list=
+ mode=0
+ [[ -z '' ]]
+ [[ -z '' ]]
+ LOG_WARN 'no thing to do.'
+ message='no thing to do.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level warn --message 'no thing to do.'
Mon Sep 11 21:31:14 2023 - WARN  - no thing to do.
+ return 0
+ LOG_INFO 'Finish environment cleanup.'
+ message='Finish environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Finish environment cleanup.'
Mon Sep 11 21:31:15 2023 - INFO  - Finish environment cleanup.